---
kind: property
id: P:Autodesk.Revit.DB.Analysis.SpatialFieldManager.ResultsVisibleInView
source: html/11673775-7ca4-4ff3-167f-f3985c8f68ba.htm
---
# Autodesk.Revit.DB.Analysis.SpatialFieldManager.ResultsVisibleInView Property

Enables analysis results visibility in the view.

## Syntax (C#)
```csharp
public bool ResultsVisibleInView { get; set; }
```